experiments/wrk2/wrk2-14/out.txt
Running 1m test @ http://192.168.1.2
  2 threads and 40 connections
  Thread calibration: mean lat.: 1371.807ms, rate sampling interval: 5025ms
  Thread calibration: mean lat.: 1482.761ms, rate sampling interval: 5386ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.52s     3.83s   16.25s    58.04%
    Req/Sec    94.14k     2.30k   97.73k    55.56%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    9.45s 
 75.000%   12.89s 
 90.000%   14.75s 
 99.000%   15.92s 
 99.900%   16.13s 
 99.990%   16.23s 
 99.999%   16.25s 
100.000%   16.26s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2652.159     0.000000           55         1.00
    4218.879     0.100000       942369         1.11
    5619.711     0.200000      1879945         1.25
    6979.583     0.300000      2821784         1.43
    8191.999     0.400000      3761487         1.67
    9453.567     0.500000      4696863         2.00
   10190.847     0.550000      5170389         2.22
   10928.127     0.600000      5637206         2.50
   11558.911     0.650000      6106692         2.86
   12222.463     0.700000      6576089         3.33
   12894.207     0.750000      7046667         4.00
   13221.887     0.775000      7280706         4.44
   13565.951     0.800000      7521819         5.00
   13885.439     0.825000      7752669         5.71
   14221.311     0.850000      7988014         6.67
   14540.799     0.875000      8227429         8.00
   14639.103     0.887500      8344950         8.89
   14753.791     0.900000      8460409        10.00
   14917.631     0.912500      8574732        11.43
   15106.047     0.925000      8693039        13.33
   15286.271     0.937500      8810654        16.00
   15359.999     0.943750      8870520        17.78
   15417.343     0.950000      8930909        20.00
   15474.687     0.956250      8986469        22.86
   15540.223     0.962500      9045557        26.67
   15622.143     0.968750      9105719        32.00
   15663.103     0.971875      9132111        35.56
   15712.255     0.975000      9162335        40.00
   15753.215     0.978125      9191040        45.71
   15794.175     0.981250      9221033        53.33
   15835.135     0.984375      9249327        64.00
   15859.711     0.985938      9265986        71.11
   15884.287     0.987500      9281000        80.00
   15908.863     0.989062      9296814        91.43
   15925.247     0.990625      9307177       106.67
   15949.823     0.992188      9320681       128.00
   15966.207     0.992969      9329795       142.22
   15982.591     0.993750      9337624       160.00
   15998.975     0.994531      9345122       182.86
   16015.359     0.995313      9352051       213.33
   16031.743     0.996094      9358336       256.00
   16039.935     0.996484      9361338       284.44
   16048.127     0.996875      9364368       320.00
   16064.511     0.997266      9370013       365.71
   16072.703     0.997656      9372345       426.67
   16089.087     0.998047      9376958       512.00
   16097.279     0.998242      9378664       568.89
   16105.471     0.998437      9380433       640.00
   16113.663     0.998633      9382056       731.43
   16121.855     0.998828      9383769       853.33
   16130.047     0.999023      9385255      1024.00
   16138.239     0.999121      9386635      1137.78
   16138.239     0.999219      9386635      1280.00
   16146.431     0.999316      9387777      1462.86
   16154.623     0.999414      9388658      1706.67
   16162.815     0.999512      9389303      2048.00
   16171.007     0.999561      9389915      2275.56
   16179.199     0.999609      9390544      2560.00
   16179.199     0.999658      9390544      2925.71
   16187.391     0.999707      9391147      3413.33
   16195.583     0.999756      9391642      4096.00
   16195.583     0.999780      9391642      4551.11
   16203.775     0.999805      9392109      5120.00
   16203.775     0.999829      9392109      5851.43
   16211.967     0.999854      9392402      6826.67
   16220.159     0.999878      9392681      8192.00
   16220.159     0.999890      9392681      9102.22
   16228.351     0.999902      9392934     10240.00
   16228.351     0.999915      9392934     11702.86
   16236.543     0.999927      9393190     13653.33
   16236.543     0.999939      9393190     16384.00
   16236.543     0.999945      9393190     18204.44
   16244.735     0.999951      9393430     20480.00
   16244.735     0.999957      9393430     23405.71
   16244.735     0.999963      9393430     27306.67
   16244.735     0.999969      9393430     32768.00
   16244.735     0.999973      9393430     36408.89
   16244.735     0.999976      9393430     40960.00
   16252.927     0.999979      9393591     46811.43
   16252.927     0.999982      9393591     54613.33
   16252.927     0.999985      9393591     65536.00
   16252.927     0.999986      9393591     72817.78
   16252.927     0.999988      9393591     81920.00
   16252.927     0.999989      9393591     93622.86
   16252.927     0.999991      9393591    109226.67
   16252.927     0.999992      9393591    131072.00
   16261.119     0.999993      9393658    145635.56
   16261.119     1.000000      9393658          inf
#[Mean    =     9524.420, StdDeviation   =     3830.379]
#[Max     =    16252.928, Total count    =      9393658]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  200.00us
 75.000%  225.00us
 90.000%  247.00us
 99.000%  305.00us
 99.900%  398.00us
 99.990%  516.00us
 99.999%    1.42ms
100.000%  132.99ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.067     0.000000            1         1.00
       0.128     0.100000       961204         1.11
       0.149     0.200000      1912274         1.25
       0.171     0.300000      2846591         1.43
       0.188     0.400000      3780379         1.67
       0.200     0.500000      4726513         2.00
       0.205     0.550000      5182452         2.22
       0.210     0.600000      5669337         2.50
       0.215     0.650000      6165690         2.86
       0.220     0.700000      6647499         3.33
       0.225     0.750000      7099956         4.00
       0.228     0.775000      7350486         4.44
       0.231     0.800000      7578685         5.00
       0.234     0.825000      7787824         5.71
       0.238     0.850000      8039953         6.67
       0.242     0.875000      8262379         8.00
       0.244     0.887500      8359274         8.89
       0.247     0.900000      8492877        10.00
       0.249     0.912500      8575759        11.43
       0.252     0.925000      8692598        13.33
       0.256     0.937500      8819484        16.00
       0.258     0.943750      8869695        17.78
       0.261     0.950000      8933610        20.00
       0.264     0.956250      8992507        22.86
       0.267     0.962500      9045098        26.67
       0.271     0.968750      9103562        32.00
       0.274     0.971875      9138365        35.56
       0.277     0.975000      9167229        40.00
       0.280     0.978125      9192018        45.71
       0.284     0.981250      9220101        53.33
       0.289     0.984375      9247449        64.00
       0.293     0.985938      9264850        71.11
       0.297     0.987500      9279308        80.00
       0.301     0.989062      9291435        91.43
       0.307     0.990625      9306205       106.67
       0.314     0.992188      9320377       128.00
       0.319     0.992969      9328635       142.22
       0.324     0.993750      9335468       160.00
       0.330     0.994531      9342528       182.86
       0.337     0.995313      9349639       213.33
       0.346     0.996094      9357145       256.00
       0.351     0.996484      9360929       284.44
       0.356     0.996875      9364391       320.00
       0.362     0.997266      9368294       365.71
       0.368     0.997656      9371854       426.67
       0.375     0.998047      9375537       512.00
       0.378     0.998242      9377161       568.89
       0.382     0.998437      9379176       640.00
       0.387     0.998633      9381174       731.43
       0.392     0.998828      9382750       853.33
       0.398     0.999023      9384493      1024.00
       0.403     0.999121      9385586      1137.78
       0.407     0.999219      9386375      1280.00
       0.412     0.999316      9387245      1462.86
       0.419     0.999414      9388199      1706.67
       0.427     0.999512      9389096      2048.00
       0.432     0.999561      9389535      2275.56
       0.438     0.999609      9389997      2560.00
       0.445     0.999658      9390500      2925.71
       0.453     0.999707      9390926      3413.33
       0.464     0.999756      9391405      4096.00
       0.470     0.999780      9391604      4551.11
       0.477     0.999805      9391831      5120.00
       0.485     0.999829      9392057      5851.43
       0.494     0.999854      9392291      6826.67
       0.504     0.999878      9392514      8192.00
       0.510     0.999890      9392626      9102.22
       0.517     0.999902      9392749     10240.00
       0.525     0.999915      9392859     11702.86
       0.535     0.999927      9392974     13653.33
       0.549     0.999939      9393096     16384.00
       0.556     0.999945      9393144     18204.44
       0.565     0.999951      9393209     20480.00
       0.579     0.999957      9393257     23405.71
       0.598     0.999963      9393314     27306.67
       0.624     0.999969      9393373     32768.00
       0.640     0.999973      9393400     36408.89
       0.668     0.999976      9393429     40960.00
       0.689     0.999979      9393458     46811.43
       0.735     0.999982      9393486     54613.33
       0.819     0.999985      9393515     65536.00
       0.843     0.999986      9393529     72817.78
       0.938     0.999988      9393544     81920.00
       1.171     0.999989      9393558     93622.86
       2.423     0.999991      9393572    109226.67
       4.187     0.999992      9393587    131072.00
       4.227     0.999993      9393595    145635.56
       4.279     0.999994      9393601    163840.00
       4.331     0.999995      9393608    187245.71
       4.727     0.999995      9393615    218453.33
     132.479     0.999996      9393626    262144.00
     132.479     0.999997      9393626    291271.11
     132.607     0.999997      9393637    327680.00
     132.607     0.999997      9393637    374491.43
     132.607     0.999998      9393637    436906.67
     132.735     0.999998      9393648    524288.00
     132.735     0.999998      9393648    582542.22
     132.735     0.999998      9393648    655360.00
     132.735     0.999999      9393648    748982.86
     132.735     0.999999      9393648    873813.33
     132.863     0.999999      9393656   1048576.00
     132.863     0.999999      9393656   1165084.44
     132.863     0.999999      9393656   1310720.00
     132.863     0.999999      9393656   1497965.71
     132.863     0.999999      9393656   1747626.67
     132.863     1.000000      9393656   2097152.00
     132.863     1.000000      9393656   2330168.89
     132.863     1.000000      9393656   2621440.00
     132.863     1.000000      9393656   2995931.43
     132.863     1.000000      9393656   3495253.33
     132.863     1.000000      9393656   4194304.00
     132.863     1.000000      9393656   4660337.78
     132.991     1.000000      9393658   5242880.00
     132.991     1.000000      9393658          inf
#[Mean    =        0.195, StdDeviation   =        0.277]
#[Max     =      132.864, Total count    =      9393658]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11236767 requests in 1.00m, 8.99GB read
Requests/sec: 187280.11
Transfer/sec:    153.41MB